Revit 2026 API

# TopographySurfaceChangePointsElevation Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void ChangePointsElevation(
	IList<XYZ> points,
	double elevationValue
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>
Public Sub ChangePointsElevation (
	points As IList(Of XYZ),
	elevationValue As Double
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
void ChangePointsElevation(
	IList<XYZ^>^ points,
	double elevationValue
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>]
member ChangePointsElevation :
        points : IList<XYZ> *
        elevationValue : float -> unit
```

#### Parameters

points IListXYZ

elevationValue Double

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace